Revit 2027 API
UIApplication.GetRibbonPanels Method
 Get all the custom Panels on Add-Ins tab of Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual List<RibbonPanel> GetRibbonPanels()
Public Overridable Function GetRibbonPanels As List(Of RibbonPanel)
public:
virtual List<RibbonPanel^>^ GetRibbonPanels()
abstract GetRibbonPanels : unit -> List<RibbonPanel>
override GetRibbonPanels : unit -> List<RibbonPanel>
Return Value
List<RibbonPanel>
Remarks
 The built-in panels won't be included and the panels added to tabs other than Add-Ins will not be included. This method is not supported in Macros.
See Also
Reference
UIApplication Class
GetRibbonPanels Overload
Autodesk.Revit.UI Namespace